## Constraints in SQL: 
### Constraints ensures,
### Data accuracy: Allow to enter the true data into the database/table.
### Data consistency: Ensures the primary key value in one table is followed by the foreign key value in another table.
### Data integrity: Ensures the data accuracy and data completeness.

## Mainly 4 types of constraints in SQL
#### 1. Domain Comstraints (not null, check)
##### i. Column value should be atomic in nature 
##### ii. Datatype for each column should be pre-fixed
#### 2. Key constraints or Uniqueness constraints
##### i. It states that an entity can have multiple keys but only one primary key.
#### 3. Entity Integrity constraints (primary key cannot be null)
##### i. It states Primary key in a table cannot be null.
#### 4. Referencial Integrity constraints (data in one table is linked to the data in another table (to ensure the data accuracy and consistency)).
##### It specified between two tables to ensure data consistency

# 1. Primary key constraint: does not null values as well as duplicate value
# 2. Not Null constraint: Does not allow null values
# 3. Composite key constraint: combination of primary keys
# 4. Unique key contraint: allows null values but not duplicate value
# 5. Check constraint: Allows user to enter valid data while insertion.
# 6. Foreign key constraint: Create a relationship between two tables.

In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:mysql@localhost

In [2]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[('de_db',),
 ('de_projects',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sample_db',),
 ('sys',),
 ('uber',)]

In [3]:
%%sql

use de_projects;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [4]:
%%sql

show tables;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('basic_table',),
 ('def_table',),
 ('dep_stud',),
 ('new_table',),
 ('tab_w_cons',)]

## 1. Primary key

In [14]:
%%sql

create table primary_key (p_id int primary key,
                        p_name varchar(50) not null);
insert into primary_key values (1, "zz");
insert into primary_key values (2, "yy");
select * from primary_key;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[(1, 'zz'), (2, 'yy')]

In [29]:
%%sql

alter table primary_key rename to pri_tab;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

## 2. Not null constraint

In [13]:
%%sql

create table not_null_cons (n_id int primary key,
                            name varchar(50) not null);
insert into not_null_cons values (1, "a");
insert into not_null_cons values (2, "b");
insert into not_null_cons values (3, "c");
select * from not_null_cons;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[(1, 'a'), (2, 'b'), (3, 'c')]

## 3. Composite key

In [10]:
%%sql

create table composite_key (name varchar(50) not null,
                            adhar varchar(12) not null,
                            ph_no varchar(10) not null,
                            primary key (adhar, ph_no)
                         );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql

insert into composite_key values ("aaa", '123456789012', '1234567890');
insert into composite_key values ("bbb", '098765432109', '0987654321');
select * from composite_key;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
2 rows affected.

[('bbb', '098765432109', '0987654321'), ('aaa', '123456789012', '1234567890')]

## 4. Unique key constraint

In [15]:
%%sql

create table unique_table (u_id int primary key,
                            ph_no varchar(10) unique);
insert into unique_table values (1, "u1");
insert into unique_table values (2, "u2");
select * from unique_table;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
1 rows affected.
1 rows affected.
2 rows affected.

[(1, 'u1'), (2, 'u2')]

In [18]:
%%sql
insert into unique_table values (3, "u3");

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

## 5. Check constraint

In [21]:
%%sql

create table check_tab (c_id int primary key,
                        c_name varchar(50) not null,
                        c_fare decimal(8, 2) check (c_fare > 0)
                       );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [23]:
%%sql

insert into check_tab values (1, "c1", 9);

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [24]:
%%sql

insert into check_tab values (2, "c2", 1000);

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [25]:
%%sql

select * from check_tab;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(1, 'c1', Decimal('9.00')), (2, 'c2', Decimal('1000.00'))]

## 6. Foreign key constraint
### If we want to insert into foreign key table then the specific primary key value should be present in the primary key table.
### If we want to delete rows from two tables, first delete the row in foreign key table and afterwards delete in the primary key table.

In [34]:
%%sql

create table for_key_tab (f_id int,
                            f_name varchar(50) not null,
                            foreign key (f_id) references pri_tab(p_id)
                            );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [36]:
%%sql

insert into for_key_tab values (1, "name1");

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [37]:
%%sql

select * from for_key_tab;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(1, 'name1')]

In [39]:
%%sql

insert into for_key_tab values (2, "bbb");
insert into for_key_tab values (2, "ccc");

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.

[]

In [40]:
%%sql

select * from for_key_tab;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[(1, 'name1'), (2, 'bbb'), (2, 'bbb'), (2, 'ccc')]

In [43]:
%%sql

delete from for_key_tab where f_id = 2;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[]

In [44]:
%%sql

select * from pri_tab;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[(1, 'zz'), (2, 'yy')]

In [45]:
%%sql

delete from pri_tab where p_id = 2;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

## Cascade delete in SQL: It deletes the record from all the tables (foreign key table and primary key table).

In [46]:
%%sql

use uber;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [64]:
%%sql


drop table driver_driver;
drop table driver_master;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [65]:
%%sql

create table driver_master (ride_id varchar(50) not null,
                            driver_id varchar(50) primary key,
                            dri_name varchar(50) not null,
                            dri_native varchar(50) not null);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [66]:
%%sql

insert into uber.driver_master values ('r01', 'dr01', 'sam', 'mangalore');
insert into uber.driver_master values ('r02', 'dr02', 'ram', 'bangalore');
insert into uber.driver_master values ('r03', 'dr03', 'joe', 'chennai');
insert into uber.driver_master values ('r04', 'dr04', 'john', 'gurgaon');

select * from uber.driver_master;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[('r01', 'dr01', 'sam', 'mangalore'),
 ('r02', 'dr02', 'ram', 'bangalore'),
 ('r03', 'dr03', 'joe', 'chennai'),
 ('r04', 'dr04', 'john', 'gurgaon')]

In [67]:
%%sql

create table driver_driver (driver_id varchar(50) not null,
                            rider_id varchar(50) not null,
                            ride_id varchar(50) primary key,
                            scr varchar(50) not null,
                            dstn varchar(50) not null,
                            fare decimal(8, 2) check (fare > 0),
                            foreign key(driver_id) references driver_master(driver_id)
                           );

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [70]:
%%sql

#insert into driver_driver values ('dr01', 'rd01', 'r06', 'chennai', 'bangalore', 8000.08);
insert into driver_driver values ('dr02', 'rd01', 'r07', 'dehli', 'mumbai', 35000.78);
insert into driver_driver values ('dr03', 'rd02', 'r08', 'mumbai', 'chattisghat', 5890.90);
insert into driver_driver values ('dr03', 'rd03', 'r010', 'kashmir', 'jammu', 1500.08);
select * from driver_driver;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[('dr03', 'rd03', 'r010', 'kashmir', 'jammu', Decimal('1500.08')),
 ('dr01', 'rd01', 'r06', 'chennai', 'bangalore', Decimal('8000.08')),
 ('dr02', 'rd01', 'r07', 'dehli', 'mumbai', Decimal('35000.78')),
 ('dr03', 'rd02', 'r08', 'mumbai', 'chattisghat', Decimal('5890.90'))]

In [75]:
%%sql

insert into uber.driver_driver values ('dr03', 'rd02', 'r012', 'bihar', 'up', 5600.00);

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [79]:
%%sql

select * from driver_master;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('r01', 'dr01', 'sam', 'mangalore'),
 ('r02', 'dr02', 'ram', 'bangalore'),
 ('r03', 'dr03', 'joe', 'chennai'),
 ('r04', 'dr04', 'john', 'gurgaon')]

In [78]:
%%sql

select * from driver_driver;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('dr03', 'rd03', 'r010', 'kashmir', 'jammu', Decimal('1500.08')),
 ('dr03', 'rd02', 'r012', 'bihar', 'up', Decimal('5600.00')),
 ('dr01', 'rd01', 'r06', 'chennai', 'bangalore', Decimal('8000.08')),
 ('dr02', 'rd01', 'r07', 'dehli', 'mumbai', Decimal('35000.78')),
 ('dr03', 'rd02', 'r08', 'mumbai', 'chattisghat', Decimal('5890.90'))]

In [80]:
%%sql

# APPROACH: 01 - deleting dr03 driver id from both the table 
# first deleting rows from foreign key table, afterwards from primary key table

delete from driver_driver where driver_id = 'dr03';
delete from driver_master where driver_id = 'dr03';

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.
1 rows affected.

[]

## Cascade command

In [81]:
%%sql

# Approach 02: Deleting rows from both primary key atble and foreign key table using ON CASCADE command
create table cascad_driver_master (dr_id varchar(50) primary key,
                                    dr_name varchar(50) not null,
                                    loc varchar(50) not null);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [83]:
%%sql

create table cascad_driver_driver (dri_id varchar(50) not null,
                                    dri_name varchar(50) not null,
                                    ride_id varchar(50) primary key,
                                    foreign key (dri_id) references cascad_driver_master(dr_id) on delete cascade
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [84]:
%%sql

insert into cascad_driver_master values ('dr1', 'driver1', 'xyz');
insert into cascad_driver_master values ('dr2', 'driver2', 'abc');
select * from cascad_driver_master;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
2 rows affected.

[('dr1', 'driver1', 'xyz'), ('dr2', 'driver2', 'abc')]

In [85]:
%%sql

insert into cascad_driver_driver values ('dr1', 'abc', 'ride1');
insert into cascad_driver_driver values ('dr2', 'xyz', 'ride2');
insert into cascad_driver_driver values ('dr1', 'abc', 'ride3');
insert into cascad_driver_driver values ('dr1', 'abc', 'ride4');
select * from cascad_driver_driver;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
4 rows affected.

[('dr1', 'abc', 'ride1'),
 ('dr2', 'xyz', 'ride2'),
 ('dr1', 'abc', 'ride3'),
 ('dr1', 'abc', 'ride4')]

In [86]:
%%sql

delete from cascad_driver_master where dr_id = 'dr1';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[]

In [87]:
%%sql

select * from cascad_driver_master;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('dr2', 'driver2', 'abc')]

In [89]:
%%sql

select * from cascad_driver_driver;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('dr2', 'xyz', 'ride2')]

## Soft delete: Adding extra column called (is_deleted: inside this column true/False values will be stored) to the foreign key table

In [100]:
%%sql

drop table sft_del_driver_master;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [101]:
%%sql

create table sft_del_driver_master (driver_id varchar(50) primary key,
                                    driver_name varchar(50) not null);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [103]:
%%sql

create table sft_driver_driver (driver_id varchar(50) not null,
                                ride_id varchar(50) primary key,
                                is_deleted bool default false,
                                foreign key (driver_id) references sft_del_driver_master (driver_id));

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [104]:
%%sql

insert into sft_del_driver_master values ('dr01', 'name1');
insert into sft_del_driver_master values ('dr02', 'name2');
insert into sft_del_driver_master values ('dr03', 'name3');
select * from sft_del_driver_master;

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.
1 rows affected.
3 rows affected.

[('dr01', 'name1'), ('dr02', 'name2'), ('dr03', 'name3')]

In [106]:
%%sql

insert into sft_driver_driver (driver_id, ride_id) values ('dr01', 'rd01');
insert into sft_driver_driver (driver_id, ride_id) values ('dr02', 'rd02');

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.
1 rows affected.

[]

In [107]:
%%sql

select * from sft_driver_driver;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('dr01', 'rd01', 0), ('dr02', 'rd02', 0)]